# **Sales Analytics**

In [1]:
#importing libraries
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#importing the dataset
df1=pd.read_csv("Sales_Data.csv")
df2=pd.read_csv("Glance_Views.csv")

### **Columns in Sales Data**

- SKU_NAME
- FEED_DATE
- CATEGORY	
- SUB_CATEGORY	
- ORDERED_REVENUE	
- ORDERED_UNITS	
- REP_OOS

### **Columns in Glance Views**
- SKU_NAME	
- FEED_DATE	
- VIEWS	
- UNITS

In [3]:
df1

,SKU_NAME,FEED_DATE,CATEGORY,SUB_CATEGORY,ORDERED_REVENUE,ORDERED_UNITS,REP_OOS
0,B12020KBUI,5/18/2019,1000 Inputs,1002 Mice,0.00,0,0.0
1,B12020KBUI,5/19/2019,1000 Inputs,1002 Mice,0.00,0,0.0
2,B12020KBUI,5/22/2019,1000 Inputs,1002 Mice,0.00,0,0.0
3,B12020KBUI,5/23/2019,1000 Inputs,1002 Mice,0.00,0,0.0
4,B12020KBUI,5/27/2019,1000 Inputs,1002 Mice,0.00,0,0.0
...,...,...,...,...,...,...,...
41110,D29S5IMRDI,8/27/2019,1000 Inputs,1007 Other Input Devices,129.99,1,0.0
41111,D29S5IMRDI,8/28/2019,1000 Inputs,1007 Other Input Devices,259.98,2,0.0
41112,D29S5IMRDI,8/29/2019,1000 Inputs,1007 Other Input Devices,259.98,2,0.0
41113,D29S5IMRDI,8/30/2019,1000 Inputs,1007 Other Input Devices,259.98,2,0.0
41114,D29S5IMRDI,8/31/2019,1000 Inputs,1007 Other Input Devices,0.00,0,0.0

In [4]:
df2

         SKU_NAME  FEED_DATE  VIEWS  UNITS
0      B1212:PZ:V   5/1/2019    455     16
1      B1212:PZ:V   5/2/2019    478     12
2      B1212:PZ:V   5/3/2019    681     42
3      B1212:PZ:V   5/4/2019    662     70
4      B1212:PZ:V   5/5/2019    568     33
...           ...        ...    ...    ...
40740  C08N8KVJDZ  8/27/2019    225     -1
40741  C08N8KVJDZ  8/28/2019    219      0
40742  C08N8KVJDZ  8/29/2019    264      0
40743  C08N8KVJDZ  8/30/2019    260      8
40744  C08N8KVJDZ  8/31/2019    254      3

[40745 rows x 4 columns]

#### **Descriptive Statistics**

In [5]:
#shape of the data
df1.shape

(41115, 7)

In [6]:
df2.shape

(40745, 4)

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41115 entries, 0 to 41114
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SKU_NAME         41115 non-null  object
 1   FEED_DATE        41115 non-null  object
 2   CATEGORY         41115 non-null  object
 3   SUB_CATEGORY     41115 non-null  object
 4   ORDERED_REVENUE  41115 non-null  float64
 5   ORDERED_UNITS    41115 non-null  int64
 6   REP_OOS          40426 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 2.2+ MB

There are null values in REP_OOS column

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40745 entries, 0 to 40744
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   SKU_NAME   40745 non-null  object
 1   FEED_DATE  40745 non-null  object
 2   VIEWS      40745 non-null  int64
 3   UNITS      40745 non-null  int64
dtypes: int64(2), object(2)
memory usage: 1.2+ MB

In [9]:
for i in df1.columns:
    print('Data type of the column {} is {}'.format(i,df1[i].dtype))
    print('Number of unique values in the column {} is {}'.format(i,df1[i].nunique()))
    print('Null values in the column {} is {}'.format(i,df1[i].isnull().sum()))
    print('='*90)

Data type of the column SKU_NAME is object
Number of unique values in the column SKU_NAME is 465
Null values in the column SKU_NAME is 0
==========================================================================================
Data type of the column FEED_DATE is object
Number of unique values in the column FEED_DATE is 123
Null values in the column FEED_DATE is 0
==========================================================================================
Data type of the column CATEGORY is object
Number of unique values in the column CATEGORY is 10
Null values in the column CATEGORY is 0
==========================================================================================
Data type of the column SUB_CATEGORY is object
Number of unique values in the column SUB_CATEGORY is 24
Null values in the column SUB_CATEGORY is 0
==========================================================================================
Data type of the column ORDERED_REVENUE is float64
Number of unique values in the column ORDERED_REVENUE is 15506
Null values in the column ORDERED_REVENUE is 0
==========================================================================================
Data type of the column ORDERED_UNITS is int64
Number of unique values in the column ORDERED_UNITS is 1011
Null values in the column ORDERED_UNITS is 0
==========================================================================================
Data type of the column REP_OOS is float64
Number of unique values in the column REP_OOS is 3388
Null values in the column REP_OOS is 689
==========================================================================================

In [12]:
for i in df2.columns:
    print('Data type of the column {} is {}'.format(i,df2[i].dtype))
    print('Number of unique values in the column {} is {}'.format(i,df2[i].nunique()))
    print('Null values in the column {} is {}'.format(i,df2[i].isnull().sum()))
    print('='*90)

Data type of the column SKU_NAME is object
Number of unique values in the column SKU_NAME is 452
Null values in the column SKU_NAME is 0
==========================================================================================
Data type of the column FEED_DATE is object
Number of unique values in the column FEED_DATE is 123
Null values in the column FEED_DATE is 0
==========================================================================================
Data type of the column VIEWS is int64
Number of unique values in the column VIEWS is 4370
Null values in the column VIEWS is 0
==========================================================================================
Data type of the column UNITS is int64
Number of unique values in the column UNITS is 1011
Null values in the column UNITS is 0
==========================================================================================